[
    {
        "name": "Aries ♈",
        "date_range": "March 21 - April 19",
        "description": "\"For Aries in 2025, expect a year of dynamic growth and new opportunities in career and finances, though balancing personal life and managing unexpected expenses will be key, especially after March.\""
    },
    {
        "name": "Taurus ♉",
        "date_range": "April 20 – May 20",
        "description": "\"For Tauruses in 2025, expect a year of steady progress and meaningful transformation, with financial gains and professional success being prominent, while relationships will deepen through honesty and grounded communication.\""
    },
    {
        "name": "Gemini ♊",
        "date_range": "May 21 – June 20",
        "description": "\"For Geminis in 2025, it's a year of transformation and growth, with opportunities for career advancement and recognition, but also a need for careful management of finances and attention to health as relationships undergo evolving dynamics.\""
    },
    {
        "name": "Cancer ♋",
        "date_range": "June 21 – July 22",
        "description": "\"For Cancers in 2025, expect a transformative year marked by significant career growth and financial reorganization, while relationships may face initial hurdles that ultimately lead to deeper emotional connections.\""
    },
    {
        "name": "Leo ♌",
        "date_range": "July 23 – August 22",
        "description": "\"For Leos in 2025, expect a year of balanced growth and smart moves, with significant opportunities for career advancement and personal transformation, though financial stability might see some fluctuations requiring careful budgeting.\""
    },
    {
        "name": "Virgo ♍",
        "date_range": "August 23 - September 22",
        "description": "\"For Virgos in 2025, expect a year of significant career advancements and financial growth, though relationships may present some hurdles that require patience and mindful communication, especially after March.\""
    },
    {
        "name": "Libra ♎",
        "date_range": "September 23 - October 22",
        "description": "\"For Libras in 2025, anticipate a year of significant growth across various life aspects, with strong financial prospects and career advancements, while relationships will thrive through open communication and harmony, provided stress and overthinking are managed.\""
    },
    {
        "name": "Scorpio ♏",
        "date_range": "October 23 - November 21",
        "description": "\"For Scorpios in 2025, expect a year of significant personal transformation and renewed focus, bringing career advancements and financial stability, though relationships may require deeper understanding and commitment.\""
    },
    {
        "name": "Sagittarius ♐",
        "date_range": "November 22 - December 21",
        "description": "\"For Sagittarians in 2025, expect a year of significant personal and professional growth, driven by career advancements and entrepreneurial success, while relationships will deepen and travel opportunities abound, though family health may require attention and financial caution is advised during certain periods.\""
    },
    {
        "name": "Capricorn ♑",
        "date_range": "December 22 - January 19",
        "description": "\"For Capricorns in 2025, expect a year of significant growth and crucial decision-making, with career opportunities flourishing and finances seeing strong progress, though relationships may experience some initial hurdles before deepening into stable, passionate connections.\""
    },
    {
        "name": "Aquarius ♒",
        "date_range": "January 20 - February 18",
        "description": "\"For Aquarians in 2025, anticipate a year of significant personal and professional transformation, marked by career advancements and improved financial stability, while relationships will deepen through shared experiences and open communication.\""
    },
    {
        "name": "Pisces ♓",
        "date_range": "February 19 - March 20 ",
        "description": "\"For Pisceans in 2025, expect a year of significant personal and spiritual growth, marked by career transformations and financial stability, while relationships will deepen through shared emotional understanding and renewed commitment.\""
    }
]